In [7]:
import pandas as pd

In [15]:
data = {
    'gender': ['men', 'men', 'men', 'women', 'women', 'women'],
    'animal': ['dog', 'cat', 'bird', 'dog', 'cat', 'bird'],
    'count': [287, 202, 241, 180, 282, 232]
}

data = pd.DataFrame(data)
data

  gender animal  count
0    men    dog    287
1    men    cat    202
2    men   bird    241
3  women    dog    180
4  women    cat    282
5  women   bird    232

In [25]:
df = pd.crosstab(data['gender'], data['animal'], values=data['count'], aggfunc='sum')

df

animal  bird  cat  dog
gender
men      241  202  287
women    232  282  180

## Null Hypothesis 

A null Hypothesis is a general statistical statement or assumption about a population parameter that is assumed to be true Until we have sufficient evidence to reject it.

It is generally denoted by Ho.

## Alternate Hypothesis

The Alternate Hypothesis is considered as competing of the null hypothesis. It is generally denoted by H1. The general goal of our hypothesis testing is to test the Alternative hypothesis against the null hypothesis.

In [27]:
from scipy.stats import chi2_contingency

# defining the table
stat, p, dof, expected = chi2_contingency(df.values)
 
# interpret p-value
alpha = 0.05
print("p value is " + str(p))
if p <= alpha:
    print('Dependent (reject H0)')
else:
    print('Independent (H0 holds true)')

p value is 9.127270143718905e-09
Dependent (reject H0)

In [29]:
stat

37.02399837109176

In [31]:
p

9.127270143718905e-09

In [33]:
dof

2

In [35]:
pd.DataFrame(expected)

            0           1          2
0  242.478933  248.117978  239.40309
1  230.521067  235.882022  227.59691